000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователя/ОповещенияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователя</name>
  <comment>Служебный ресурс</comment>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействиеКоманда</name>
    <comment>Задается литерально для облегчения использования в коде</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Некторый объект</comment>
    <type>
      <types>String</types>
      <types>Date</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>АдминистраторАвтоматов</name>
      <description>Нуралиев Борис Георгиевич</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователя/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить оповещения пользователя.
// 
// Возвращаемое значение:
//  Массив - Получить оповещения пользователя
Функция ПолучитьОповещенияПользователя() Экспорт

	СписокОповещений = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОповещений.Пользователь КАК Пользователь,
	|	ТаблицаОповещений.ДействиеКоманда КАК ДействиеКоманда,
	|	ТаблицаОповещений.Объект КАК Объект,
	|	ИСТИНА КАК Оповестить
	|ИЗ
	|	РегистрСведений.ОповещенияПользователя КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.Пользователь = &ТекущийПользователь
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаОповещений.Пользователь,
	|	ТаблицаОповещений.ДействиеКоманда,
	|	ТаблицаОповещений.Объект,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ОповещенияПользователя КАК ТаблицаОповещений
	|ГДЕ
	|	РАЗНОСТЬДАТ(ТаблицаОповещений.ДатаИзменения, &ТекущаяДата, МИНУТА) >= 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаОповещений.Пользователь,
	|	ТаблицаОповещений.ДействиеКоманда,
	|	ТаблицаОповещений.Объект,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ОповещенияПользователя КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаОповещений.Пользователь,
	|	ТаблицаОповещений.ДействиеКоманда,
	|	ТаблицаОповещений.Объект,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ОповещенияПользователя КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.АдминистраторАвтоматов)"
	);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

//	Сообщаем и очищаем по текущему пользователю, а так же просто очищаем все
//	записи, "старшие" 1 минуты, независимо от пользователя.
//	Примечание: 1 минута взята просто "с пальца на ветер". Если будет необходимость, изменяем смело.
//	.. но не забываем отметить об таком изменении в этом комментарии.
//	Так же безусловно чистим все записи, относящиеся к Нуралиеву или пустому пользователю.
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			СписокОповещений.Добавить(
				Новый Структура(
					"Пользователь, ИмяСобытия, Параметр, Оповестить, Выполнено"
					, Выборка.Пользователь
					, Выборка.ДействиеКоманда
					, Новый Структура("Объект", Выборка.Объект)
					, Выборка.Оповестить
					, Ложь
				)
			);

		КонецЦикла;

	КонецЕсли;

	Возврат СписокОповещений;

КонецФункции

// Удалить оповещения пользователя.
// 
// Параметры:
//  СписокОповещений - Массив - Список оповещений
Процедура УдалитьОповещенияПользователя(СписокОповещений)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Для Каждого СоставОповещения Из СписокОповещений Цикл

		Если СоставОповещения.Выполнено Тогда

			НачатьТранзакцию();
			Попытка
		
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОповещенияПользователя");
				ЭлементБлокировки.УстановитьЗначение("Пользователь", СоставОповещения.Пользователь);
				ЭлементБлокировки.УстановитьЗначение("ДействиеКоманда", СоставОповещения.ИмяСобытия);
				ЭлементБлокировки.УстановитьЗначение("Объект", СоставОповещения.Параметр.Объект);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				Блокировка.Заблокировать(); 
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Пользователь.Установить(СоставОповещения.Пользователь);
				НаборЗаписей.Отбор.ДействиеКоманда.Установить(СоставОповещения.ИмяСобытия);
				НаборЗаписей.Отбор.Объект.Установить(СоставОповещения.Параметр.Объект);

				НаборЗаписей.Записать(Истина);
				
				ЗафиксироватьТранзакцию();
			
			Исключение
				
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				ВызватьИсключение;
		
			КонецПопытки;			

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Установить.
// 
// Параметры:
//  Объект - ЛюбаяСсылка - Объект
//  ДействиеКоманда - Строка - Действие команда
//  Пользователь - СправочникСсылка.Пользователи,Неопределено - Пользователь
Процедура Установить(Объект, ДействиеКоманда, Пользователь = Неопределено)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Пользователь = Неопределено
			И (ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка()
				Или  ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.АдминистраторАвтоматов) Тогда
					
		Возврат;
		
	Иначе
		
		ПользовательОповещения = ?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь);
		
	КонецЕсли;
	
	Попытка

		НачатьТранзакцию();
	
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОповещенияПользователя");
		ЭлементБлокировки.УстановитьЗначение("Пользователь", ПользовательОповещения);
		ЭлементБлокировки.УстановитьЗначение("ДействиеКоманда", ДействиеКоманда);
		ЭлементБлокировки.УстановитьЗначение("Объект", Объект);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать(); 
		
		НаборЗаписей = СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Пользователь.Установить(ПользовательОповещения);
		НаборЗаписей.Отбор.ДействиеКоманда.Установить(ДействиеКоманда);
		НаборЗаписей.Отбор.Объект.Установить(Объект);

		ЗаписьНабора = НаборЗаписей.Добавить();

		ЗаписьНабора.Пользователь = НаборЗаписей.Отбор.Пользователь.Значение;
		ЗаписьНабора.ДействиеКоманда = НаборЗаписей.Отбор.ДействиеКоманда.Значение;
		ЗаписьНабора.Объект = НаборЗаписей.Отбор.Объект.Значение;

		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ВызватьИсключение;

	КонецПопытки;			

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
